# concat() merges a list of dataframes. The dataframees are merged from left to right, with the second one placed at the bottom of the first one and so on
- objs - The list of data frames to merge
- ignore_index (optional) - Set it to True when the indices are to be ignored from the sources, in which case, a new index is created for the resultant data frame. It defaults to False
- keys (optional) - A list of strings one for each data frame. It creates a multi index, with the index at level 0 set to the key

In [2]:
import pandas as pd
foods = pd.read_csv("data/restaurant_foods.csv")
foods.head()

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

In [3]:
customers = pd.read_csv("data/restaurant_customers.csv")
customers.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [5]:
week1_sales = pd.read_csv("data/restaurant_week_1_sales.csv")
week1_sales.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [6]:
week2_sales = pd.read_csv("data/restaurant_week_2_sales.csv")
week2_sales.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [10]:
# ignore_index defaults to False, setting it to True will ignore the indices and create a brand new one for the merged dataframe
total_sales = pd.concat([week1_sales, week2_sales], ignore_index=False).sort_index()
total_sales.head(10)

   Customer ID  Food ID
0          537        9
0          688       10
1           97        4
1          813        7
2          658        1
2          495       10
3          202        2
3          189        5
4          155        9
4          267        3

In [11]:
# setting ignore_index to True ignores the indices from the sources and creates a new index for the merged data frame 
total_sales_ignore_index = pd.concat([week1_sales, week2_sales], ignore_index=True).sort_index()
total_sales_ignore_index.head(10)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9
5          213        8
6          600        1
7          503        5
8           71        3
9          174        3

In [15]:
# use keys to create a multi index with level 0 of the multi index set to key and level 1 set to the original index
total_sales_with_keys = pd.concat([week1_sales, week2_sales], ignore_index=False, keys=["Week 1", "Week 2"]).sort_index()
total_sales_with_keys

# total_sales_with_keys.index

            Customer ID  Food ID
Week 1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]